[
    {
        "subtopic": "Course Details",
        "subsections": [
            {
                "heading": "Introduction",
                "content": "This section provides an overview of the course details page. Here, you can find comprehensive information about the courses you are managing, including their structure, assigned teaching assistants, and evaluation data.",
                "tags": [
                    "intro",
                    "Course Details"
                ]
            },
            {
                "heading": "Navigating the Course Details",
                "content": "The course details page is divided into multiple sections: \n\n1. **Course Information**: Displays basic details like course name, department, and capacity. \n\n2. **Instructor Details**: Lists the instructor's information, including their name and contact details. \n\n3. **Enrolled Students**: Shows the number of students enrolled in the course. \n\n4. **Teaching Assistants**: Lists the TAs assigned to the course and their roles. \n\nUse the tabs at the top to switch between these sections for a more detailed view.",
                "tags": [
                    "navigation",
                    "Course Details"
                ]
            },
            {
                "heading": "Editing Course Information",
                "content": "To edit course information: \n\n1. Click the 'Edit' button at the top. \n\n2. Fields such as course name, department, capacity, and others will become editable. \n\n3. Make the necessary changes and click 'Save' to update the course details. \n\nRemember to verify the information before saving to ensure accuracy.",
                "tags": [
                    "editing",
                    "Course Details"
                ]
            },
            {
                "heading": "Assigning TAs",
                "content": "To assign teaching assistants to a course: \n\n1. Click the 'Assign TA' button. \n\n2. A modal will appear where you can select the TA, instructor, and course. \n\n3. Confirm the assignment to save the changes. \n\nThe assigned TAs will now appear in the course details under the Teaching Assistants section.",
                "tags": [
                    "assign",
                    "TA",
                    "Course Details"
                ]
            },
            {
                "heading": "SEI Data",
                "content": "The SEI (Student Evaluation of Instruction) data section provides insights into student feedback for the course. \n\nTo edit SEI data: \n\n1. Click the 'Edit SEI' button. \n\n2. Update the relevant fields with the new data. \n\n3. Click 'Save' to apply the changes. \n\nThis data helps in evaluating the course performance and identifying areas for improvement.",
                "tags": [
                    "sei",
                    "data",
                    "Course Details"
                ]
            }
        ]
    }
]
